Repository: astechtic/ayuvo
Catalog: ios/calorietracker/Localizable.xcstrings
Source language: en
Languages: ar, az, cs, de, es, fr, hi, it, ja, ko, nl, pl, pt_br, ro, ru, uk, zh_hans

source: I live in Germany, assume European portion sizes. I'm on a bodybuilding cut.
ar: أعيش في ألمانيا، افترض أحجام حصص أوروبية. أنا في مرحلة تخفيض لكمال الأجسام.
az: Almaniyada yaşayıram, Avropa porsiya ölçülərini fərz et. Bodibildinq kəsim mərhələsindəyəm.
cs: Bydlím v Česku, počítej s evropskými velikostmi porcí. Jsem v rýsovací fázi.
de: Ich lebe in Deutschland, gehe von europäischen Portionsgrößen aus. Ich bin in einer Bodybuilding-Diät.
es: Vivo en Alemania, asume tamaños de porciones europeas. Estoy en una etapa de definición de culturismo.
fr: J'habite en Allemagne, prends en compte les portions européennes. Je suis en sèche bodybuilding.
hi: मैं जर्मनी में रहता हूँ, यूरोपीय सर्विंग साइज़ मानें। मैं बॉडीबिल्डिंग कट पर हूँ।
it: Vivo in Germania, assumi porzioni europee. Sono in una fase di definizione bodybuilding.
ja: ドイツに住んでいます。ヨーロッパの分量を想定してください。ボディビルのカット中です。
ko: 독일에 살고 있습니다. 유럽식 1인분 크기를 가정해주세요. 보디빌딩 컷 중입니다.
nl: Ik woon in Duitsland, ga uit van Europese portiegroottes. Ik zit in een bodybuilding-cut.
pl: Mieszkam w Niemczech, zakładaj europejskie porcje. Jestem na redukcji kulturystycznej.
pt_br: Moro na Alemanha, considere porções europeias. Estou em fase de cutting de musculação.
ro: Locuiesc în Germania, presupune porții europene. Sunt în faza de cut de culturism.
ru: Я живу в Германии, считай порции европейскими. Я на сушке для бодибилдинга.
uk: Я живу в Германии, считай порции европейскими. Я на сушке для бодибилдинга.
zh_hans: 我住在德国，请按欧洲分量大小计算。我正在健美减脂期。

source: Imperial
ar: إمبراطوري
cs: Imperiální
fr: Impérial
hi: इम्पीरियल
it: Imperiale
ja: ヤード・ポンド法
ko: 야드파운드법
nl: Imperiaal
pl: Imperialne
ru: Имперская
uk: Імперська
zh_hans: 英制

source: In 60 days
ar: خلال 60 يومًا
az: 60 gün sonra
cs: Za 60 dní
de: In 60 Tagen
es: En 60 días
fr: Dans 60 jours
hi: 60 दिनों में
it: Tra 60 giorni
ja: 60日後
ko: 60일 후
nl: Over 60 dagen
pl: Za 60 dni
pt_br: Em 60 dias
ro: În 60 de zile
ru: Через 60 дней
uk: Через 60 дней
zh_hans: 60天后

source: In 90 days
ar: خلال 90 يومًا
az: 90 gün sonra
cs: Za 90 dní
de: In 90 Tagen
es: En 90 días
fr: Dans 90 jours
hi: 90 दिनों में
it: Tra 90 giorni
ja: 90日後
ko: 90일 후
nl: Over 90 dagen
pl: Za 90 dni
pt_br: Em 90 dias
ro: În 90 de zile
ru: Через 90 дней
uk: Через 90 дней
zh_hans: 90天后

source: Inches
ar: إنش
az: Düym
cs: Palce
de: Zoll
es: Pulgadas
fr: Pouces
hi: इंच
it: Pollici
ja: インチ
ko: 인치
pl: Cale
pt_br: Polegadas
ro: Țoli
ru: Дюймы
uk: Дюйми
zh_hans: 英寸

source: Instructions
ar: التعليمات
az: Təlimatlar
cs: Provedení
de: Anleitung
es: Instrucciones
hi: निर्देश
it: Istruzioni
ja: 手順
ko: 운동 방법
nl: Instructies
pl: Instrukcje
pt_br: Instruções
ro: Instrucțiuni
ru: Инструкция
uk: Інструкції
zh_hans: 动作说明

source: Invalid Goal Weight
ar: وزن الهدف غير صالح
az: Yanlış Hədəf Çəkisi
cs: Neplatná cílová váha
de: Ungültiges Zielgewicht
es: Peso objetivo no válido
fr: Poids cible invalide
hi: अमान्य लक्ष्य वजन
it: Peso obiettivo non valido
ja: 無効な目標体重
ko: 잘못된 목표 체중
nl: Ongeldig streefgewicht
pl: Nieprawidłowa waga docelowa
pt_br: Peso-meta inválido
ro: Greutate obiectiv nevalidă
ru: Неверный целевой вес
uk: Неверний целевой вес
zh_hans: 目标体重无效

source: Join Discord
ar: انضم إلى Discord
az: Discord-a qoşul
cs: Připojit se na Discord
de: Discord beitreten
es: Unirse a Discord
fr: Rejoindre Discord
hi: Discord से जुड़ें
it: Unisciti a Discord
ja: Discordに参加
ko: Discord 참여
pl: Dołącz do Discorda
pt_br: Entrar no Discord
ro: Alătură-te pe Discord
ru: Присоединиться к Discord
uk: Приєднатися до Discord
zh_hans: 加入 Discord

source: Katch-McArdle equation
ar: معادلة كاتش–مكاردل
az: Katch–McArdle tənliyi
de: Katch-McArdle-Gleichung
es: Ecuación de Katch-McArdle
fr: Équation de Katch-McArdle
hi: कैच-मैकआर्डल समीकरण
it: Equazione di Katch-McArdle
ja: Katch-McArdle式
ko: Katch-McArdle 방정식
nl: Katch-McArdle-vergelijking
pl: Równanie Katcha–McArdle’a
pt_br: Equação de Katch-McArdle
ro: Ecuația Katch-McArdle
ru: Уравнение Кэтча–МакАрдла
uk: Рівняння Кетча-МакАрдла
zh_hans: Katch-McArdle 方程

source: Keep Going
ar: استمر
az: Davam Et
cs: Jen tak dál
de: Weitermachen
es: Seguir
fr: Continuer
hi: जारी रखें
it: Continua
ja: 続ける
ko: 계속하기
nl: Ga door
pl: Kontynuuj
pt_br: Continuar
ro: Continuă
ru: Продолжить
uk: Рухаємось далі
zh_hans: 继续

source: Keep the camera fully covered and reduce pressure or movement.
ar: أبقِ الكاميرا مغطاة بالكامل وقلّل الضغط أو الحركة.
az: Kameranı tam örtülü saxlayın, təzyiqi və ya hərəkəti azaldın.
de: Halte die Kamera vollständig bedeckt und verringere Druck oder Bewegung.
es: Mantén la cámara completamente cubierta y reduce la presión o el movimiento.
fr: Gardez la caméra entièrement couverte et réduisez la pression ou les mouvements.
hi: कैमरे को पूरी तरह ढका रखें और दबाव या हलचल कम करें।
it: Mantieni la fotocamera completamente coperta e riduci la pressione o il movimento.
ja: カメラを完全に覆ったまま、力や動きを弱めてください。
ko: 카메라를 완전히 가린 채 압력이나 움직임을 줄이세요.
nl: Houd de camera volledig bedekt en verminder de druk of beweging.
pl: Trzymaj aparat całkowicie zakryty i zmniejsz nacisk lub ruch.
pt_br: Mantenha a câmera totalmente coberta e reduza a pressão ou o movimento.
ro: Ține camera complet acoperită și redu presiunea sau mișcarea.
ru: Полностью закройте камеру и уменьшите давление или движение.
uk: Полностью закройте камеру и уменьшите давление или движение.
zh_hans: 保持相机完全被遮住，并减轻按压力度或减少移动。

source: Keep your nutrition, steps, and body measurements in sync automatically.
ar: حافظ على تزامن التغذية والخطوات وقياسات الجسم تلقائيًا.
az: Qidalanma, addımlar və bədən ölçülərini avtomatik sinxron saxlayın.
de: Halte Ernährung, Schritte und Körper- maße automatisch synchron.
es: Mantén tu nutrición, pasos y medidas corporales sincronizados automáticamente.
fr: Gardez votre nutrition, vos pas et vos mesures corporelles synchronisés automatiquement.
hi: अपने पोषण, कदम और शरीर के माप को अपने आप सिंक रखें।
it: Tieni sincronizzati automaticamente nutrizione, passi e misure corporee.
ja: 栄養、歩数、身体測定を 自動的に同期します。
ko: 영양, 걸음 수, 신체 측정을 자동으로 동기화하세요.
nl: Houd je voeding, stappen en lichaams- metingen automatisch gesynchroniseerd.
pl: Synchronizuj automatycznie odżywianie, kroki i pomiary ciała.
pt_br: Mantenha nutrição, passos e medidas corporais sincronizados automaticamente.
ro: Păstrează sincronizate automat nutriția, pașii și măsurătorile corporale.
ru: Синхронизируйте питание, шаги и измерения тела автоматически.
uk: Синхронизируйте питание, шаги и измерения тела автоматически.
zh_hans: 自动同步营养、步数和身体 测量数据。

source: Latest
ar: الأحدث
az: Son
de: Letzter Wert
es: Último valor
fr: Dernier relevé
hi: नवीनतम
it: Ultimo valore
ja: 最新
ko: 최근
nl: Laatste
pl: Ostatni
pt_br: Mais recente
ro: Ultimul
ru: Последнее
uk: Останнє
zh_hans: 最新

source: Legal
ar: القانونية
az: Hüquqi
de: Rechtliches
fr: Mentions légales
hi: कानूनी
it: Note legali
ja: 法的情報
ko: 법률
nl: Juridisch
pl: Informacje prawne
pt_br: Informações legais
ro: Informații juridice
ru: Правовая информация
uk: Правова інформація
zh_hans: 法律信息

source: Let's get started!
ar: لنبدأ!
az: Başlayaq!
cs: Jdeme na to!
de: Los geht's!
es: ¡Empecemos!
fr: C'est parti !
hi: चलिए शुरू करते हैं!
it: Iniziamo!
ja: さあ始めましょう！
ko: 시작해 볼까요!
nl: Laten we beginnen!
pl: Zaczynamy!
pt_br: Vamos começar!
ro: Să începem!
ru: Начнём!
uk: Начнём!
zh_hans: 开始吧！

source: Level
ar: المستوى
az: Səviyyə
cs: Obtížnost
es: Nivel
fr: Niveau
hi: स्तर
it: Livello
ja: レベル
ko: 난이도
nl: Niveau
pl: Poziom
pt_br: Nível
ro: Nivel
ru: Уровень
uk: Рівень
zh_hans: 难度

source: Light
ar: فاتح
az: İşıqlı
cs: Světlý
de: Hell
es: Claro
fr: Clair
hi: लाइट
it: Chiaro
ja: ライト
ko: 라이트
nl: Licht
pt_br: Claro
ro: Luminos
ru: Светлая
uk: Світлий
zh_hans: 浅色

source: Local data
ar: بيانات محلية
az: Lokal məlumatlar
cs: Místní data
de: Lokale Daten
es: Datos locales
fr: Données locales
hi: लोकल डेटा
it: Dati locali
ja: ローカルデータ
ko: 로컬 데이터
nl: Lokale gegevens
pl: Dane lokalne
pt_br: Dados locais
ro: Date locale
ru: Локальные данные
uk: Локальние данние
zh_hans: 本地数据

source: Locked
ar: مقفل
az: Kilidli
cs: Zamčeno
de: Gesperrt
es: Bloqueado
fr: Verrouillé
hi: लॉक है
it: Bloccato
ja: ロック中
ko: 잠김
nl: Vergrendeld
pl: Zablokowane
pt_br: Bloqueado
ro: Blocat
ru: Заблокировано
uk: Заблоковано
zh_hans: 已锁定

source: Log
ar: تسجيل
az: Qeyd Et
cs: Zapsat
es: Registro
fr: Journal
hi: लॉग
it: Registra
ja: 記録
ko: 기록
pl: Dodaj
pt_br: Registrar
ro: Jurnal
ru: Журнал
uk: Записати
zh_hans: 记录

source: Log at least 2 days of food and 2 weights to see your forecast.
ar: سجّل ما لا يقل عن يومين من الطعام ووزنين لرؤية توقعاتك.
az: Proqnozunuzu görmək üçün ən azı 2 günlük yemək və 2 çəki qeyd edin.
cs: Zapiš alespoň 2 dny jídla a 2 vážení, aby se zobrazila předpověď.
de: Protokolliere mindestens 2 Tage Essen und 2 Gewichte, um deine Prognose zu sehen.
es: Registra al menos 2 días de comida y 2 pesajes para ver tu previsión.
fr: Enregistrez au moins 2 jours de repas et 2 pesées pour voir votre prévision.
hi: अपना पूर्वानुमान देखने के लिए कम से कम 2 दिन का भोजन और 2 वज़न दर्ज करें।
it: Registra almeno 2 giorni di cibo e 2 pesate per vedere la tua previsione.
ja: 予測を表示するには、食事を2日分と体重を2回以上記録してください。
ko: 예측을 보려면 최소 2일간의 식사와 2회의 체중을 기록하세요.
nl: Log minstens 2 dagen voeding en 2 gewichten om je voorspelling te zien.
pl: Dodaj co najmniej 2 dni jedzenia i 2 pomiary wagi, aby zobaczyć prognozę.
pt_br: Registre pelo menos 2 dias de comida e 2 pesagens para ver sua previsão.
ro: Înregistrează cel puțin 2 zile de mâncare și 2 cântăriri pentru a vedea prognoza.
ru: Запишите минимум 2 дня еды и 2 измерения веса, чтобы увидеть прогноз.
uk: Запишите минимум 2 дня еди и 2 измерения веса, чтоби увидеть прогноз.
zh_hans: 至少记录2天的饮食和2次体重,才能查看预测。

source: Log Body Fat
ar: تسجيل نسبة الدهون
az: Bədən yağını qeyd et
cs: Zapsat tělesný tuk
de: Körperfett protokollieren
es: Registrar grasa corporal
fr: Enregistrer la masse grasse
hi: बॉडी फैट दर्ज करें
it: Registra grasso corporeo
ja: 体脂肪を記録
ko: 체지방 기록
nl: Vetpercentage loggen
pl: Dodaj pomiar tkanki tłuszczowej
pt_br: Registrar gordura corporal
ro: Înregistrează grăsimea corporală
ru: Записать жир
uk: Записати відсоток жиру
zh_hans: 记录体脂

source: Log Weight
ar: تسجيل الوزن
az: Çəkini Qeyd Et
cs: Zapsat váhu
de: Gewicht erfassen
es: Registrar peso
fr: Enregistrer le poids
hi: वजन लॉग करें
it: Registra peso
ja: 体重を記録
ko: 체중 기록
nl: Gewicht loggen
pl: Dodaj wagę
pt_br: Registrar peso
ro: Înregistrează greutatea
ru: Записать вес
uk: Журнал ваги
zh_hans: 记录体重

source: Log your first body fat % to see trends
ar: سجّل أول قياس لنسبة الدهون لرؤية الاتجاهات
az: Trendləri görmək üçün ilk bədən yağı %-ni qeyd edin
cs: Zapiš první hodnotu tělesného tuku a sleduj trendy
de: Erfasse deinen ersten Körperfettwert, um Trends zu sehen
es: Registra tu primer % de grasa corporal para ver tendencias
fr: Enregistre ton premier % de masse grasse pour voir les tendances
hi: रुझान देखने के लिए अपना पहला बॉडी फैट % दर्ज करें
it: Registra il tuo primo % di grasso corporeo per vedere le tendenze
ja: 傾向を見るには、最初の体脂肪率を記録してください
ko: 추이를 보려면 첫 체지방률을 기록하세요
nl: Log je eerste vetpercentage om trends te zien
pl: Dodaj pierwszy pomiar % tkanki tłuszczowej, aby zobaczyć trendy
pt_br: Registre seu primeiro % de gordura corporal para ver tendências
ro: Înregistrează primul tău % de grăsime corporală pentru a vedea tendințele
ru: Запишите первое измерение жира, чтобы увидеть динамику
uk: Зареєструйте свій перший показник жиру в організмі, щоб переглянути тенденції
zh_hans: 记录你的第一个体脂百分比以查看趋势

source: Lunch
ar: غداء
az: Nahar
cs: Oběd
de: Mittagessen
es: Almuerzo
fr: Déjeuner
hi: लंच
it: Pranzo
ja: ランチ
ko: 점심
pt_br: Almoço
ro: Prânz
ru: Обед
uk: Обід
zh_hans: 午餐

source: Macro Averages
ar: متوسطات العناصر الكبرى
az: Makro Ortalamaları
cs: Průměry makroživin
de: Makro-Durchschnitt
es: Promedios de macros
fr: Moyennes des macros
hi: मैक्रो औसत
it: Medie macro
ja: マクロ平均
ko: 매크로 평균
nl: Gemiddelde macro's
pl: Średnie makro
pt_br: Médias de macros
ro: Medii macronutrienți
ru: Средние макросы
uk: Середні макроси
zh_hans: 宏量平均值

source: Macro suggestions?
ar: اقتراحات للماكرو؟
az: Makro təklifləri?
cs: Doporučení k makrům?
de: Makro-Vorschläge?
es: ¿Sugerencias de macros?
fr: Suggestions de macros ?
hi: मैक्रो सुझाव?
it: Suggerimenti sui macro?
ja: マクロの提案は?
ko: 매크로 추천은?
nl: Macro-suggesties?
pl: Sugestie makro?
pt_br: Sugestões de macros?
ro: Sugestii pentru macros?
ru: Советы по макросам?
uk: Поради щодо макросів?
zh_hans: 宏量营养建议?

source: Macronutrient split
ar: تقسيم المغذيات الكبرى
az: Makronutrient bölgüsü
cs: Rozložení makroživin
de: Makronährstoff-Verteilung
es: Reparto de macronutrientes
fr: Répartition des macronutriments
hi: मैक्रोन्यूट्रिएंट विभाजन
it: Ripartizione dei macronutrienti
ja: マクロ栄養素の配分
ko: 다량영양소 비율
nl: Macronutriëntenverdeling
pl: Podział makroskładników
pt_br: Divisão de macronutrientes
ro: Împărțirea macronutrienților
ru: Распределение макронутриентов
uk: Розподіл макронутрієнтів
zh_hans: 宏量营养素比例

source: Macros
ar: العناصر الكبرى
az: Makrolar
cs: Makroživiny
de: Makros
hi: मैक्रो
it: Macro
ja: マクロ
ko: 매크로
pl: Makra
ro: Macronutrienți
ru: Макросы
uk: Макроси
zh_hans: 宏量营养素

source: Made by Apoorv Darshan
ar: صنع بواسطة Apoorv Darshan
az: Apoorv Darshan tərəfindən hazırlanıb
cs: Vytvořil Apoorv Darshan
de: Erstellt von Apoorv Darshan
es: Hecho por Apoorv Darshan
fr: Créé par Apoorv Darshan
hi: Apoorv Darshan द्वारा निर्मित
it: Realizzato da Apoorv Darshan
ja: Apoorv Darshan 制作
ko: Apoorv Darshan 제작
nl: Gemaakt door Apoorv Darshan
pl: Autor: Apoorv Darshan
pt_br: Feito por Apoorv Darshan
ro: Realizat de Apoorv Darshan
ru: Автор: Apoorv Darshan
uk: Автор: Apoorv Darshan
zh_hans: 由 Apoorv Darshan 制作

source: Maintenance & goal adjustment
ar: الحفاظ على الوزن وتعديل الهدف
az: Çəkini qoruma və hədəf düzəlişi
de: Erhaltung & Zielanpassung
es: Mantenimiento y ajuste del objetivo
fr: Maintien et ajustement de l’objectif
hi: मेंटेनेंस और लक्ष्य समायोजन
it: Mantenimento e adeguamento dell’obiettivo
ja: 維持カロリーと目標の調整
ko: 유지 칼로리 및 목표 조정
nl: Onderhoud en doelaanpassing
pl: Utrzymanie i korekta celu
pt_br: Manutenção e ajuste da meta
ro: Menținere și ajustarea obiectivului
ru: Поддержание и корректировка цели
uk: Підтримка та коригування цілі
zh_hans: 维持热量和目标调整

source: Maintenance starts from your TDEE — or, when Energy Burn is on, from Apple Health’s recent measured-energy window instead of the formula estimate: measured total energy when enough days are available; otherwise, average measured active energy + formula BMR. The AI refines maintenance against your logged intake and weight trend, then applies your goal: a weekly weight-change rate becomes a daily calorie deficit (Lose) or surplus (Gain).
ar: تبدأ سعرات الحفاظ من TDEE، أو عند تشغيل Energy Burn من نافذة بيانات الطاقة المقاسة الحديثة في Apple Health بدلًا من تقدير المعادلة: إجمالي الطاقة المقاس عند توفر أيام كافية، وإلا فمتوسط الطاقة النشطة المقاسة + BMR المحسوب بالمعادلة. يحسّن الذكاء الاصطناعي سعرات الحفاظ بمقارنتها بمدخولك المسجل واتجاه وزنك، ثم يطبّق هدفك: تتحول وتيرة تغيّر الوزن الأسبوعية إلى عجز يومي في السعرات للخسارة أو فائض يومي للزيادة.
az: Saxlama səviyyəsi TDEE-dən başlayır; Energy Burn aktiv olduqda isə düstur təxmini əvəzinə Apple Health-də son ölçülmüş enerji məlumatları dövründən istifadə olunur: kifayət qədər gün olduqda ölçülmüş ümumi enerji, əks halda ölçülmüş aktiv enerjinin ortalaması + düsturla hesablanan BMR. AI saxlama səviyyəsini qeyd etdiyiniz qəbul və çəki tendensiyası ilə dəqiqləşdirir, sonra hədəfinizi tətbiq edir: həftəlik çəki dəyişmə tempi arıqlama üçün gündəlik kalori kəsirinə, kökəlmə üçün isə artığına çevrilir.
de: Der Erhaltungsbedarf basiert zunächst auf deinem TDEE — oder, wenn Energy Burn aktiviert ist, auf dem jüngsten Messfenster für Energiedaten aus Apple Health anstelle der Formelschätzung: dem gemessenen Gesamtenergieverbrauch, wenn genügend Tage verfügbar sind, andernfalls dem durchschnittlichen gemessenen aktiven Energieverbrauch + dem Formel-BMR. Die KI gleicht den Erhaltungsbedarf mit deiner protokollierten Aufnahme und deinem Gewichtsverlauf ab und wendet dann dein Ziel an: Eine wöchentliche Gewichtsänderungsrate wird zu einem täglichen Kaloriendefizit beim Abnehmen oder Kalorienüberschuss beim Zunehmen.
es: El mantenimiento parte de tu TDEE o, cuando Energy Burn está activado, de la ventana reciente de energía medida de Apple Health en vez de la estimación de la fórmula: energía total medida cuando hay suficientes días; de lo contrario, energía activa medida promedio + BMR de la fórmula. La IA ajusta el mantenimiento contrastándolo con tu ingesta registrada y la tendencia de tu peso, y después aplica tu objetivo: una tasa semanal de cambio de peso se convierte en un déficit calórico diario para perder peso o en un superávit para ganarlo.
fr: La maintenance part de votre TDEE ou, quand Energy Burn est activé, de la fenêtre récente de données énergétiques mesurées de Apple Health au lieu de l’estimation de la formule : dépense énergétique totale mesurée lorsque suffisamment de jours sont disponibles ; sinon, moyenne de l’énergie active mesurée + BMR calculé par la formule. L’IA affine la maintenance en fonction de vos apports enregistrés et de l’évolution de votre poids, puis applique votre objectif : un rythme hebdomadaire de variation du poids devient un déficit calorique quotidien pour perdre du poids ou un surplus pour en prendre.
hi: मेंटेनेंस आपके TDEE से शुरू होती है — या Energy Burn चालू होने पर फ़ॉर्मूला अनुमान की जगह Apple Health के हाल में मापे गए ऊर्जा डेटा की अवधि से: पर्याप्त दिनों का डेटा होने पर मापी गई कुल ऊर्जा; अन्यथा, मापी गई सक्रिय ऊर्जा का औसत + फ़ॉर्मूला BMR। AI दर्ज किए गए सेवन और वज़न के रुझान से मेंटेनेंस को बेहतर बनाता है, फिर आपका लक्ष्य लागू करता है: साप्ताहिक वज़न-बदलाव दर घटाने के लिए दैनिक कैलोरी घाटा या बढ़ाने के लिए दैनिक अधिशेष बनती है।
it: Il mantenimento parte dal tuo TDEE oppure, quando Energy Burn è attivo, dalla finestra recente dei dati energetici misurati da Apple Health invece che dalla stima della formula: energia totale misurata quando sono disponibili abbastanza giorni; altrimenti, media dell’energia attiva misurata + BMR calcolato con la formula. L’IA perfeziona il mantenimento confrontandolo con l’apporto registrato e l’andamento del peso, quindi applica il tuo obiettivo: un tasso settimanale di variazione del peso diventa un deficit calorico giornaliero per dimagrire o un surplus per aumentare di peso.
ja: 維持カロリーはTDEEを出発点にします。ただしEnergy Burnがオンの場合は、式による推定値の代わりにApple Healthの最近の実測エネルギーデータ期間を使います。十分な日数がある場合は実測の総エネルギー、そうでない場合は実測アクティブエネルギーの平均＋式で求めたBMRを使います。AIは記録した摂取量と体重の推移に照らして維持カロリーを調整し、目標を適用します。週ごとの体重変化率を、減量では1日のカロリー不足分、増量では余剰分に換算します。
ko: 유지 칼로리는 TDEE에서 시작합니다. 단, Energy Burn이 켜져 있으면 공식 추정값 대신 Apple Health의 최근 측정 에너지 구간을 사용합니다. 충분한 날짜가 있으면 측정된 총에너지를, 그렇지 않으면 측정된 활동 에너지 평균 + 공식 BMR을 사용합니다. AI는 기록된 섭취량과 체중 추세에 맞춰 유지 칼로리를 보정한 뒤 목표를 적용합니다. 주간 체중 변화율은 감량 시 일일 칼로리 부족분, 증량 시 잉여분으로 변환됩니다.
nl: Onderhoud begint bij je TDEE — of, wanneer Energy Burn aanstaat, bij het recente meetvenster voor energie uit Apple Health in plaats van de formuleschatting: gemeten totale energie wanneer er genoeg dagen beschikbaar zijn; anders de gemiddelde gemeten actieve energie + de formule-BMR. De AI verfijnt het onderhoud aan de hand van je gelogde inname en gewichtstrend en past daarna je doel toe: een wekelijkse snelheid van gewichtsverandering wordt een dagelijks calorietekort voor afvallen of een calorieoverschot voor aankomen.
pl: Utrzymanie zaczyna się od TDEE — lub, gdy Energy Burn jest włączone, od ostatniego okna zmierzonych danych energii w Apple Health zamiast oszacowania ze wzoru: gdy dostępna jest wystarczająca liczba dni, używana jest zmierzona energia całkowita; w przeciwnym razie średnia zmierzona energia aktywna + BMR ze wzoru. AI koryguje utrzymanie na podstawie zapisanej podaży i trendu wagi, a następnie stosuje cel: tygodniowe tempo zmiany wagi staje się dziennym deficytem kalorii (Redukcja) lub nadwyżką (Przyrost).
pt_br: A manutenção parte do seu TDEE ou, quando o Energy Burn está ativado, da janela recente de energia medida do Apple Health em vez da estimativa da fórmula: energia total medida quando houver dias suficientes; caso contrário, média da energia ativa medida + BMR da fórmula. A IA refina a manutenção usando a ingestão registrada e a tendência do peso e depois aplica sua meta: uma taxa semanal de mudança de peso vira um déficit calórico diário para perder peso ou um superávit para ganhar.
ro: Menținerea pornește de la TDEE sau, când Energy Burn este activat, de la intervalul recent de energie măsurată din Apple Health în locul estimării formulei: energia totală măsurată când sunt disponibile suficiente zile; altfel, media energiei active măsurate + BMR calculat prin formulă. AI ajustează menținerea pe baza aportului înregistrat și a tendinței greutății, apoi aplică obiectivul: o rată săptămânală de schimbare a greutății devine un deficit caloric zilnic pentru slăbire sau un surplus pentru creștere.
ru: Поддержание рассчитывается от TDEE — или, если включён Energy Burn, по данным об энергии из Apple Health за недавний период вместо оценки по формуле: измеренный общий расход энергии, если доступно достаточно дней; иначе среднее измеренной активной энергии + BMR по формуле. ИИ уточняет поддержание по фактическому рациону и динамике веса, затем применяет цель: недельная скорость изменения веса превращается в дневной дефицит (снижение) или профицит (набор) калорий.
uk: Поддержание рассчитивается от TDEE — или, если включён Energy Burn, по данним об енергии из Apple Health за недавний период вместо оценки по формуле: измеренний общий расход енергии, если доступно достаточно дней; иначе среднее измеренной активной енергии + BMR по формуле. ШІ уточняет поддержание по фактическому рациону и динамике веса, затем применяет цель: недельная скорость изменения веса превращается в дневной дефицит (снижение) или профицит (набор) калорий.
zh_hans: 维持热量从你的 TDEE 开始；若开启 Energy Burn，则使用 Apple Health 的近期实测能量窗口，而不是公式估算：有足够天数时使用实测总能量，否则使用实测活动能量平均值 + 公式 BMR。AI 会结合你记录的摄入量和体重趋势校准维持热量，然后应用目标：每周体重变化率会转换为减重时的每日热量缺口或增重时的每日热量盈余。

source: Male
ar: ذكر
az: Kişi
cs: Muž
de: Männlich
es: Hombre
fr: Homme
hi: पुरुष
it: Uomo
ja: 男性
ko: 남성
nl: Man
pl: Mężczyzna
pt_br: Masculino
ro: Bărbat
ru: Мужской
uk: Чоловік
zh_hans: 男性

source: Manual
ar: يدوي
az: Əl ilə
de: Manuell
fr: Manuel
hi: मैन्युअल
it: Manuale
ja: 手動
ko: 수동
nl: Handmatig
pl: Ręcznie
ru: Вручную
uk: Вручную
zh_hans: 手动

source: Max 2 Macros Locked
ar: قفل عنصرين ماكرو كحد أقصى
az: Ən çox 2 makro kilidlənə bilər
cs: Max. 2 zamčená makra
de: Max. 2 Makros gesperrt
es: Máximo 2 macros bloqueados
fr: 2 macros verrouillées max
hi: अधिकतम 2 मैक्रोज़ लॉक
it: Max 2 macro bloccate
ja: ロックは最大2つまで
ko: 최대 2개 매크로 잠금
nl: Max. 2 macro's vergrendeld
pl: Maks. 2 zablokowane makra
pt_br: Máx. de 2 macros bloqueados
ro: Maxim 2 macronutrienți blocați
ru: Максимум 2 макронутриента
uk: Максимум 2 заблоковані макроси
zh_hans: 最多锁定 2 个宏量营养素

source: Max 2 Pinned
ar: الحد الأقصى 2 مثبتة
az: Maks. 2 Sabitlənmiş
cs: Max. 2 připnutá
de: Max. 2 angeheftet
es: Máx. 2 fijados
fr: Max. 2 épinglés
hi: अधिकतम 2 पिन
it: Max 2 fissati
ja: 最大2つ固定
ko: 최대 2개 고정
nl: Max. 2 vastgezet
pl: Maks. 2 przypięte
pt_br: Máx. 2 fixados
ro: Max 2 fixați
ru: Макс. 2 закреплено
uk: Максимум 2 заблоковані макроси
zh_hans: 最多固定 2 个

source: Max Response Tokens
ar: الحد الأقصى لرموز الاستجابة
az: Maksimum Cavab Token-ləri
cs: Max. tokenů odpovědi
de: Max. Antwort-Tokens
es: Máx. tokens de respuesta
fr: Tokens de réponse max.
hi: अधिकतम रिस्पॉन्स टोकन
it: Token di risposta max.
ja: 最大応答トークン
ko: 최대 응답 토큰
nl: Max. reactietokens
pl: Maks. tokeny odpowiedzi
pt_br: Máx. de tokens de resposta
ro: Tokenuri maxime de răspuns
ru: Макс. токенов ответа
uk: Максимальна кількість токенів
zh_hans: 最大响应令牌数

source: Maximum
ar: الأعلى
az: Maksimum
es: Máximo
hi: अधिकतम
it: Massimo
ja: 最大
ko: 최고
pl: Maksimum
pt_br: Máximo
ro: Maxim
ru: Максимум
uk: Максимум
zh_hans: 最高
